{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 150, 150, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d", 0, 0, {}]]], "name": "batch_normalization_v1"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation"}, "inbound_nodes": [[["batch_normalization_v1", 0, 0, {}]]], "name": "activation"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_1", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_v1_1"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_v1_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_2", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_v1_2"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_v1_2", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "dtype": "float32", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "max_pooling2d"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_3", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_v1_3"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_3"}, "inbound_nodes": [[["batch_normalization_v1_3", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_4", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_v1_4"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_4"}, "inbound_nodes": [[["batch_normalization_v1_4", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "dtype": "float32", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_8", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_v1_8"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_8"}, "inbound_nodes": [[["batch_normalization_v1_8", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_6", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_v1_6"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_9", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_v1_9"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_6"}, "inbound_nodes": [[["batch_normalization_v1_6", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_9"}, "inbound_nodes": [[["batch_normalization_v1_9", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d", "dtype": "float32", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "average_pooling2d"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_11", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["average_pooling2d", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_5", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_v1_5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_7", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_v1_7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_10", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_v1_10"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_11", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_v1_11"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_5"}, "inbound_nodes": [[["batch_normalization_v1_5", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_7"}, "inbound_nodes": [[["batch_normalization_v1_7", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_10"}, "inbound_nodes": [[["batch_normalization_v1_10", 0, 0, {}]]], "name": "activation_10"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_11"}, "inbound_nodes": [[["batch_normalization_v1_11", 0, 0, {}]]], "name": "activation_11"}, {"class_name": "Concatenate", "config": {"dtype": "float32", "trainable": false, "name": "mixed0", "axis": 3}, "inbound_nodes": [[["activation_5", 0, 0, {}], ["activation_7", 0, 0, {}], ["activation_10", 0, 0, {}], ["activation_11", 0, 0, {}]]], "name": "mixed0"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_15", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_15"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_15", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_v1_15"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_15"}, "inbound_nodes": [[["batch_normalization_v1_15", 0, 0, {}]]], "name": "activation_15"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_13", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_13"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_16", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_16"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_13", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_v1_13"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_16", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_v1_16"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_13"}, "inbound_nodes": [[["batch_normalization_v1_13", 0, 0, {}]]], "name": "activation_13"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_16"}, "inbound_nodes": [[["batch_normalization_v1_16", 0, 0, {}]]], "name": "activation_16"}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "dtype": "float32", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "average_pooling2d_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_12", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed0", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_14", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_14"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_17", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_18", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_18"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_12", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_v1_12"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_14", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_v1_14"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_17", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_v1_17"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_18", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_v1_18"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_12"}, "inbound_nodes": [[["batch_normalization_v1_12", 0, 0, {}]]], "name": "activation_12"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_14"}, "inbound_nodes": [[["batch_normalization_v1_14", 0, 0, {}]]], "name": "activation_14"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_17"}, "inbound_nodes": [[["batch_normalization_v1_17", 0, 0, {}]]], "name": "activation_17"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_18"}, "inbound_nodes": [[["batch_normalization_v1_18", 0, 0, {}]]], "name": "activation_18"}, {"class_name": "Concatenate", "config": {"dtype": "float32", "trainable": false, "name": "mixed1", "axis": 3}, "inbound_nodes": [[["activation_12", 0, 0, {}], ["activation_14", 0, 0, {}], ["activation_17", 0, 0, {}], ["activation_18", 0, 0, {}]]], "name": "mixed1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_22", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_22"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_22", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_v1_22"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_22"}, "inbound_nodes": [[["batch_normalization_v1_22", 0, 0, {}]]], "name": "activation_22"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_20", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_20"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_23", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_23"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_20", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_v1_20"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_23", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_v1_23"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_20"}, "inbound_nodes": [[["batch_normalization_v1_20", 0, 0, {}]]], "name": "activation_20"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_23"}, "inbound_nodes": [[["batch_normalization_v1_23", 0, 0, {}]]], "name": "activation_23"}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "dtype": "float32", "trainable": false, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "average_pooling2d_2"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_19", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed1", 0, 0, {}]]], "name": "conv2d_19"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv2d_21"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_24", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_25", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "conv2d_25"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_19", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_v1_19"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_21", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_v1_21"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_24", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_v1_24"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_25", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_v1_25"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_19"}, "inbound_nodes": [[["batch_normalization_v1_19", 0, 0, {}]]], "name": "activation_19"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_21"}, "inbound_nodes": [[["batch_normalization_v1_21", 0, 0, {}]]], "name": "activation_21"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_24"}, "inbound_nodes": [[["batch_normalization_v1_24", 0, 0, {}]]], "name": "activation_24"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_25"}, "inbound_nodes": [[["batch_normalization_v1_25", 0, 0, {}]]], "name": "activation_25"}, {"class_name": "Concatenate", "config": {"dtype": "float32", "trainable": false, "name": "mixed2", "axis": 3}, "inbound_nodes": [[["activation_19", 0, 0, {}], ["activation_21", 0, 0, {}], ["activation_24", 0, 0, {}], ["activation_25", 0, 0, {}]]], "name": "mixed2"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_27", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_27"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_27", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_v1_27"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_27"}, "inbound_nodes": [[["batch_normalization_v1_27", 0, 0, {}]]], "name": "activation_27"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_28", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_27", 0, 0, {}]]], "name": "conv2d_28"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_28", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_v1_28"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": false, "name": "activation_28"}, "inbound_nodes": [[["batch_normalization_v1_28", 0, 0, {}]]], "name": "activation_28"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_26", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["mixed2", 0, 0, {}]]], "name": "conv2d_26"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_29", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_29"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_26", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_v1_26"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_v1_29", "dtype": "float32", "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "axis": [3], "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_v1_29"}, {"class_name": "Activation", "config": {"dtype": 